---
kind: type
id: T:Autodesk.Revit.DB.StickSymbolLocation
source: html/ed40b53f-0352-dc83-6b25-bf64af88e1f2.htm
---
# Autodesk.Revit.DB.StickSymbolLocation

Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL_STICK_SYMBOL_LOCATION.

## Syntax (C#)
```csharp
public enum StickSymbolLocation
```